pulp-platform/pulp-trainlib/lib/sources/stm32_matmul.c
void naive_conv2d_fw_kernel (void * void_args) 
{
  struct matMul_args* args = (struct matMul_args *)void_args;
  float * __restrict__ inData = args->A;
  float * __restrict__ coeffData = args->B;
  float * __restrict__ outData = args->C;

  const int H_in = args->H;
  const int W_in = args->W;
  const int pW = args->pW;
  const int pH = args->pH;
  const int C_in = args->pCin;
  const int C_out = args->pCout;

  const int H_out = H_in - pH + 1;
  const int W_out = W_in - pW + 1;

  for (int co=0; co<C_out; co++) {
    for (int ho=0; ho<H_out; ho++) {
      for (int wo=0; wo<W_out; wo++) {
        outData[wo+ho*W_out+co*H_out*W_out] = 0;
        // Receptive field
        for (int ci=0; ci<C_in; ci++) {
          for (int hk=0; hk<pH; hk++) {
            for (int wk=0; wk<pW; wk++) {
              outData[wo+ho*W_out+co*H_out*W_out] += inData[wo+wk+(ho+hk)*W_in+ci*H_in*W_in] * coeffData[wk+hk*pW+ci*pH*pW+co*C_in*pH*pW];
            }
          }
        }
      }
    }
  }

}



void naive_conv2d_param_grad_kernel (void * void_args) 
{
  struct matMul_args* args = (struct matMul_args *)void_args;
  float * __restrict__ inData = args->A;
  float * __restrict__ coeffData = args->B;
  float * __restrict__ outData = args->C;

  const int H_in = args->H;
  const int W_in = args->W;
  const int pW = args->pW;
  const int pH = args->pH;
  const int C_in = args->pCin;
  const int C_out = args->pCout;

  const int H_out = H_in - pH + 1;
  const int W_out = W_in - pW + 1;

  

}



void naive_conv2d_in_grad_kernel (void * void_args) 
{
  struct matMul_args* args = (struct matMul_args *)void_args;
  float * __restrict__ inData = args->A;
  float * __restrict__ coeffData = args->B;
  float * __restrict__ outData = args->C;

  const int H_in = args->H;
  const int W_in = args->W;
  const int pW = args->pW;
  const int pH = args->pH;
  const int C_in = args->pCin;
  const int C_out = args->pCout;

  const int H_out = H_in - pH + 1;
  const int W_out = W_in - pW + 1;



}







/**
 * OPTIMIZED VERSIONS
 */

// Naive mm with unrolling of 2
void mm_u2 (void * void_args) {

  struct matMul_args* args = (struct matMul_args *)void_args;
  float * __restrict__ A = args->A;
  float * __restrict__ B = args->B;
  float * __restrict__ C = args->C;

  int N = args->N;
  int M = args->M;
  int K = args->K;

  int transp = args->trans_B;

  // =====> B NOT TRANSPOSED <=====
  if (transp==0)
  {
    for (int i=0; i < N; i++) 
    {
      for (int j = 0; j < M; j++) 
      {
        float temp = 0;
        for (int k = 0; k < (K & 0xfffffffe); k=k+2) 
        {
              temp += A[i*K+k]   * B[j+k*M];
              temp += A[i*K+k+1] * B[j+(k+1)*M];
        } 
        C[i*M+j] = temp;
      } 
    } 
    // Leftover on K
    if (K & 0x00000001)
    {
      for (int i=0; i<N; i++) 
      {
        for (int j=0; j<M; j++) 
        {
          C[i*M+j] += A[i*K+(K-1)] * B[j+(K-1)*M];
        }
      }
    }
  }

  // =====> B IS TRANSPOSED <=====
  else 
  {
    for (int i=0; i < N; i++) 
    {
      for (int j = 0; j < M; j++) 
      {
        float temp = 0;
        for (int k = 0; k < (K & 0xfffffffe); k=k+2) 
        {
              temp += A[i*K+k]   * B[k+j*K];
              temp += A[i*K+k+1] * B[k+1+j*K];              
        } 
        C[i*M+j] = temp;
        //temp = 0;
      } 
    } 
    // Leftover on K 
    if (K & 0x00000001)
    {
      for (int i=0; i<N; i++) 
      {
        for (int j=0; j<M; j++) 
        {
          C[i*M+j] += A[i*K+(K-1)] * B[(K-1)+j*K];
        }
      }
    }
  }
}



void mm_unroll_1x2 (void * void_args) 
{
  struct matMul_args* args = (struct matMul_args *)void_args;
  float * __restrict__ A = args->A;
  float * __restrict__ B = args->B;
  float * __restrict__ C = args->C;

  int N = args->N;
  int M = args->M;
  int K = args->K;
  int transp = args->trans_B;

  // Check if sizes are smaller than the unrolling, and take countermeasures
  if (M < 2) { mm(args); }
  else 
  {
    // =====> B NOT TRANSPOSED <=====
    if (transp == 0) 
    {
      // Unrolled core
      for (int i=0; i<N; i++) 
      {
        for (int j=0; j<(M & 0xfffffffe); j=j+2)
        {
          float temp0 = 0;
          float temp1 = 0;

          for (int k=0; k<K; k++) 
          {
            int idx   = k*M+j;
            float Ash = A[i*K+k];
            temp0     += Ash * B[idx];
            temp1     += Ash * B[idx+1];
          }
          C[i*M+j]    = temp0;
          C[i*M+j+1]  = temp1;
        }
      }
      // Leftover on M
      if (M & 0x00000001) 
      {
        for (int i=0; i<N; i++) 
        {
          float temp = 0;
          for (int k=0; k<K; k++)
          {
            temp += A[i*K+k] * B[k*M+M-1];
          }
          C[i*M+M-1] = temp;
        }
      }
    }

    // =====> B IS TRANSPOSED <=====
    else 
    {
      // Unrolled core
      for (int i=0; i<N; i++) 
      {
        for (int j=0; j<(M & 0xfffffffe); j=j+2)
        {
          float temp0 = 0;
          float temp1 = 0;

          for (int k=0; k<K; k++) 
          {
            int idx   = k+j*K;
            float Ash = A[i*K+k];
            temp0     += Ash * B[idx];
            temp1     += Ash * B[idx+K];
          }
          C[i*M+j]    = temp0;
          C[i*M+j+1]  = temp1;
        }
      }
      // Leftover on M
      if (M & 0x00000001) 
      {
        for (int i=0; i<N; i++) 
        {
          float temp = 0;
          for (int k=0; k<K; k++)
          {
            temp += A[i*K+k] * B[k+(M-1)*K];
          }
          C[i*M+M-1] = temp;
        }
      }    
    }
  }
}



void mm_unroll_1x4 (void * void_args)
{
  struct matMul_args* args = (struct matMul_args *)void_args;
  float * __restrict__ A = args->A;
  float * __restrict__ B = args->B;
  float * __restrict__ C = args->C;

  int N = args->N;
  int M = args->M;
  int K = args->K;
  int transp = args->trans_B;

  // Check if sizes are smaller than the unrolling, and take countermeasures
  if (M < 4) { mm_unroll_1x2(args); }
  else 
  {
    // =====> B NOT TRANSPOSED <=====
    if (transp == 0)
    {
      // Unrolled core
      for (int i=0; i<N; i++) 
      {
        for (int j=0; j<(M & 0xfffffffc); j=j+4)
        {
          float temp0 = 0;
          float temp1 = 0;
          float temp2 = 0;
          float temp3 = 0;

