pulp-platform/pulp-trainlib/lib/sources/stm32_matmul.c
  // Check if sizes are smaller than the unrolling, and take countermeasures
  if      ((N_par/NUM_CORES) < 2) { mm_unroll_1x8(args); }
  else if ((N_par/NUM_CORES) < 4) { mm_unroll_2x4(args); }
  else if (M < 4)                 { mm_unroll_2x2(args); }
  else 
  {
    // =====> B NOT TRANSPOSED
    if (transp == 0)
    {
      // Unrolled core
      for (int i=0; i<N_par; i=i+4) 
      {
        for (int j=0; j<(M & 0xfffffffc); j=j+4)
        {
          temp0 = 0;  temp8   = 0;
          temp1 = 0;  temp9   = 0;
          temp2 = 0;  temp10  = 0;
          temp3 = 0;  temp11  = 0;
          temp4 = 0;  temp12  = 0;
          temp5 = 0;  temp13  = 0;
          temp6 = 0;  temp14  = 0;
          temp7 = 0;  temp15  = 0;

          for (int k=0; k<K; k++) 
          {
            int idx   = k*M+j;
            // First A row
            float Ash = A[i*K+k];
            float Ba  = B[idx];
            float Bb  = B[idx+1];
            float Bc  = B[idx+2];
            float Bd  = B[idx+3];
            temp0     += Ash * Ba;
            temp1     += Ash * Bb;
            temp2     += Ash * Bc;
            temp3     += Ash * Bd;
            // Second A row
            Ash       = A[(i+1)*K+k];
            temp4     += Ash * Ba;
            temp5     += Ash * Bb;
            temp6     += Ash * Bc;
            temp7     += Ash * Bd;
            // Third A row
            Ash       = A[(i+2)*K+k];
            temp8     += Ash * Ba;
            temp9     += Ash * Bb;
            temp10    += Ash * Bc;
            temp11    += Ash * Bd;
            // Fourth A row
            Ash       = A[(i+3)*K+k];
            temp12    += Ash * Ba;
            temp13    += Ash * Bb;
            temp14    += Ash * Bc;
            temp15    += Ash * Bd;
          }
          C[i*M+j]        = temp0;
          C[i*M+j+1]      = temp1;
          C[i*M+j+2]      = temp2;
          C[i*M+j+3]      = temp3;
          C[(i+1)*M+j]    = temp4;
          C[(i+1)*M+j+1]  = temp5;
          C[(i+1)*M+j+2]  = temp6;
          C[(i+1)*M+j+3]  = temp7;
          C[(i+2)*M+j]    = temp8;
          C[(i+2)*M+j+1]  = temp9;
          C[(i+2)*M+j+2]  = temp10;
          C[(i+2)*M+j+3]  = temp11;
          C[(i+3)*M+j]    = temp12;
          C[(i+3)*M+j+1]  = temp13;
          C[(i+3)*M+j+2]  = temp14;
          C[(i+3)*M+j+3]  = temp15;
        }
        // Leftover in M
        if (M & 0x00000003) 
        {
          for (int ii=i; ii<i+4; ii++) 
          {
            for (int j=(M-(M & 0x00000003)); j<M; j++)
            {
              float left_temp = 0;
              for (int k=0; k<K; k++)
              {
                left_temp += A[ii*K+k] * B[k*M+j];
              }
              C[ii*M+j] = left_temp;
            }
          }
        }
      }

      // Leftover in N (parallel on M)
      if (N_left > 0)
      {
        for (int i=N-N_left; i<N; i++)
        {
          for (int j=0; j<M; j++)
          {
            float temp_left = 0;
            for (int k=0; k<K; k++)
            {
              temp_left += A[i*K+k] * B[j+k*M];
            }
            C[i*M+j] = temp_left;
          }
        }
      }
    }

    // =====> B IS TRANSPOSED <=====
    else 
    {
      // Unrolled core
      for (int i=0; i<N_par; i=i+4) 
      {
        for (int j=0; j<(M & 0xfffffffc); j=j+4)
        {
          temp0 = 0;  temp8   = 0;
          temp1 = 0;  temp9   = 0;
          temp2 = 0;  temp10  = 0;
          temp3 = 0;  temp11  = 0;
          temp4 = 0;  temp12  = 0;
          temp5 = 0;  temp13  = 0;
          temp6 = 0;  temp14  = 0;
          temp7 = 0;  temp15  = 0;

          for (int k=0; k<K; k++) 
          {
            int idx   = k+j*K;
            // First A row
            float Ash = A[i*K+k];
            float Ba  = B[idx];
            float Bb  = B[idx+K];
            float Bc  = B[idx+2*K];
            float Bd  = B[idx+3*K];
            temp0     += Ash * Ba;
            temp1     += Ash * Bb;
            temp2     += Ash * Bc;
            temp3     += Ash * Bd;
            // Second A row
            Ash       = A[(i+1)*K+k];
            temp4     += Ash * Ba;
            temp5     += Ash * Bb;
            temp6     += Ash * Bc;
            temp7     += Ash * Bd;
            // Third A row
            Ash       = A[(i+2)*K+k];
            temp8     += Ash * Ba;
            temp9     += Ash * Bb;
            temp10    += Ash * Bc;
            temp11    += Ash * Bd;
            // Fourth A row
            Ash       = A[(i+3)*K+k];
            temp12    += Ash * Ba;
            temp13    += Ash * Bb;
            temp14    += Ash * Bc;
            temp15    += Ash * Bd;
          }
          C[i*M+j]        = temp0;
          C[i*M+j+1]      = temp1;
          C[i*M+j+2]      = temp2;
          C[i*M+j+3]      = temp3;
          C[(i+1)*M+j]    = temp4;
          C[(i+1)*M+j+1]  = temp5;
          C[(i+1)*M+j+2]  = temp6;
          C[(i+1)*M+j+3]  = temp7;
          C[(i+2)*M+j]    = temp8;
          C[(i+2)*M+j+1]  = temp9;
          C[(i+2)*M+j+2]  = temp10;
          C[(i+2)*M+j+3]  = temp11;
          C[(i+3)*M+j]    = temp12;
          C[(i+3)*M+j+1]  = temp13;
          C[(i+3)*M+j+2]  = temp14;
          C[(i+3)*M+j+3]  = temp15;
        }
        // Leftover in M
        if (M & 0x00000003) 
        {
          for (int ii=i; ii<i+4; ii++) 
          {
            for (int j=(M-(M & 0x00000003)); j<M; j++)
            {
              float left_temp = 0;
              for (int k=0; k<K; k++)
              {
                left_temp += A[ii*K+k] * B[k+j*K];
              }
              C[ii*M+j] = left_temp;
            }
          }
        }
      }

      // Leftover in N (parallel on M)
      if (N_left > 0)
      {
        for (int i=N-N_left; i<N; i++)
        {
          for (int j=0; j<M; j++)
          {
            float temp_left = 0;
            for (int k=0; k<K; k++)
            {
              temp_left += A[i*K+k] * B[j*K+k];
            }
            C[i*M+j] = temp_left;
          }
        }
      }
    }
  }
}
















// Matmul for depthwise convolutions
void mm_dw_u2(void * void_args) {

  struct matMul_DW_args* args = (struct matMul_DW_args *)void_args;
  float * __restrict__ A = args->A;
  float * __restrict__ B = args->B;
  float * __restrict__ C = args->C;

  int N = args->N;
  int M = args->M;
  int K = args->K;
  int ker_dim = args->ker_size;

  int k = 0;

  if (ker_dim < 2) { mm_dw(args); }
  else
  {
    float a = 0;
    float b = 0;
    int idx_a = 0;
    int idx_b = 0;

    for (int i = 0; i < 1; i++) {  
      for (int j = 0; j < M; j++) {
        for (int k=0; k < N; k++) {
          float temp = 0;
          for (int t = 0; t < (ker_dim & 0xfffffffe); t=t+2) {
              temp += A[i*K+(k*ker_dim+t)] * B[j*(N*ker_dim)+(k*ker_dim+t)];
              temp += A[i*K+(k*ker_dim+t+1)] * B[j*(N*ker_dim)+(k*ker_dim+t+1)];            
          }
          // Leftover on ker_dim
          if (ker_dim & 1) {
            temp += A[i*K+(k*ker_dim+ker_dim-1)] * B[j*(N*ker_dim)+(k*ker_dim+ker_dim-1)];
          }
          C[i*M+j+k*M] = temp;
        } //k
      } //j
    } //i
  }
}



// Matmul for depthwise convolutions
void mm_dw_u3(void * void_args) {

  struct matMul_DW_args* args = (struct matMul_DW_args *)void_args;
  float * __restrict__ A = args->A;
  float * __restrict__ B = args->B;
  float * __restrict__ C = args->C;

  int N = args->N;
  int M = args->M;
  int K = args->K;
  int ker_dim = args->ker_size;

  int k = 0;

  if (ker_dim < 3) { mm_dw(args); }
  else
  {
    float a = 0;
    float b = 0;
    int idx_a = 0;
    int idx_b = 0;

    for (int i = 0; i < 1; i++) {  
      for (int j = 0; j < M; j++) {
        for (int k=0; k < N; k++) {
          float temp = 0;
          for (int t = 0; t < (ker_dim & 0xfffffffd); t=t+3) {
              temp += A[i*K+(k*ker_dim+t)] * B[j*(N*ker_dim)+(k*ker_dim+t)];
              temp += A[i*K+(k*ker_dim+t+1)] * B[j*(N*ker_dim)+(k*ker_dim+t+1)];
              temp += A[i*K+(k*ker_dim+t+2)] * B[j*(N*ker_dim)+(k*ker_dim+t+2)];
          }
          // Leftover on ker_dim
          if (ker_dim % 3) {
            if (ker_dim & 0x00000001) {
              temp += A[i*K+(k*ker_dim+ker_dim-1)] * B[j*(N*ker_dim)+(k*ker_dim+ker_dim-1)];
            }
            else {
              temp += A[i*K+(k*ker_dim+ker_dim-2)] * B[j*(N*ker_dim)+(k*ker_dim+ker_dim-2)];
              temp += A[i*K+(k*ker_dim+ker_dim-1)] * B[j*(N*ker_dim)+(k*ker_dim+ker_dim-1)];
            }
          }
          C[i*M+j+k*M] = temp;
        } //k
      } //j
    } //i
  }
}



// Matmul for depthwise convolutions
void mm_dw_unroll_1x2(void * void_args) {

  struct matMul_DW_args* args = (struct matMul_DW_args *)void_args;
  float * __restrict__ A = args->A;
  float * __restrict__ B = args->B;
  float * __restrict__ C = args->C;

  int N = args->N;
  int M = args->M;
  int K = args->K;

  int ker_dim = args->ker_size;

  int k = 0;

  if (M < 2) { mm_dw(args); }
  else 
  {
      for (int j = 0; j < (M & 0xfffffffe); j+=2) 
      {
        for (int k=0; k < N; k++) 
        {
          float temp0 = 0;
          float temp1 = 0;

          for (int t = 0; t < ker_dim; t++) 
          {
            float Ash  = A[k*ker_dim+t];
            temp0     += Ash * B[j*(N*ker_dim)+(k*ker_dim+t)];
            temp1     += Ash * B[(j+1)*(N*ker_dim)+(k*ker_dim+t)];
          }
          C[j+k*M]    = temp0;
          C[j+1+k*M]  = temp1;
        }
        // Leftover in M
        if (M % 2) 
        {
          for (int k=0; k < N; k++) 
          {
            float temp = 0;

            for (int t = 0; t < ker_dim; t++) 
            {
              temp += A[(k*ker_dim+t)] * B[(M-1)*(N*ker_dim)+(k*ker_dim+t)];
            }
            C[(M-1)+k*M]    = temp;
          }        
        } 
      } 
    } 
}



// Matmul for depthwise convolutions
void mm_dw_unroll_1x4(void * void_args) {

  struct matMul_DW_args* args = (struct matMul_DW_args *)void_args;
  float * __restrict__ A = args->A;
  float * __restrict__ B = args->B;
  float * __restrict__ C = args->C;

  int N = args->N;
  int M = args->M;
  int K = args->K;

  int ker_dim = args->ker_size;

  int k = 0;

