pulp-platform/pulp-trainlib/lib/sources/stm32_matmul.c
  if (M < 4) { mm_dw_unroll_1x2(args); }
  else
  {
    int M_left = M % 4;

      for (int j = 0; j < (M & 0xfffffffc); j+=4) 
      {
        for (int k=0; k < N; k++) 
        {
          float temp0 = 0;
          float temp1 = 0;
          float temp2 = 0;
          float temp3 = 0;

          for (int t = 0; t < ker_dim; t++) 
          {
            float Ash  = A[(k*ker_dim+t)];
            temp0     += Ash * B[j*(N*ker_dim)+(k*ker_dim+t)];
            temp1     += Ash * B[(j+1)*(N*ker_dim)+(k*ker_dim+t)];
            temp2     += Ash * B[(j+2)*(N*ker_dim)+(k*ker_dim+t)];
            temp3     += Ash * B[(j+3)*(N*ker_dim)+(k*ker_dim+t)];
          }
          C[j+k*M]    = temp0;
          C[j+1+k*M]  = temp1;
          C[j+2+k*M]  = temp2;
          C[j+3+k*M]  = temp3;
        }
        // Leftover in M
        if (M % 4) 
        {
          for (int j = M-M_left; j < M; j++) 
          {
            for (int k=0; k < N; k++) 
            {
              float temp = 0; 
              for (int t = 0; t < ker_dim; t++) 
              {
                temp += A[(k*ker_dim+t)] * B[j*(N*ker_dim)+(k*ker_dim+t)];
              }
              C[j+k*M] = temp;
            }        
          }
        } 
      } 
    }
}



// Matmul for depthwise convolutions
void mm_dw_unroll_1x2_u2(void * void_args) {

  struct matMul_DW_args* args = (struct matMul_DW_args *)void_args;
  float * __restrict__ A = args->A;
  float * __restrict__ B = args->B;
  float * __restrict__ C = args->C;

  int N = args->N;
  int M = args->M;
  int K = args->K;

  int ker_dim = args->ker_size;

  int k = 0;

  if      (M < 2)         { mm_dw(args); }
  else if (ker_dim < 2)   { mm_dw_unroll_1x2(args); }
  else 
  {
      for (int j = 0; j < (M & 0xfffffffe); j+=2) 
      {
        for (int k=0; k < N; k++) 
        {
          float temp0 = 0;
          float temp1 = 0;

          for (int t = 0; t < (ker_dim & 0xfffffffe); t+=2) 
          {
            float Ash  = A[(k*ker_dim+t)];
            temp0     += Ash * B[j*(N*ker_dim)+(k*ker_dim+t)];
            temp1     += Ash * B[(j+1)*(N*ker_dim)+(k*ker_dim+t)];
            Ash        = A[(k*ker_dim+t+1)];
            temp0     += Ash * B[j*(N*ker_dim)+(k*ker_dim+t+1)];
            temp1     += Ash * B[(j+1)*(N*ker_dim)+(k*ker_dim+t+1)];
          }
          if (ker_dim & 1) {
            temp0     += A[(k*ker_dim+ker_dim-1)] * B[j*(N*ker_dim)+(k*ker_dim+ker_dim-1)];
            temp1     += A[(k*ker_dim+ker_dim-1)] * B[(j+1)*(N*ker_dim)+(k*ker_dim+ker_dim-1)];
          }
          C[j+k*M]    = temp0;
          C[j+1+k*M]  = temp1;
        }
        // Leftover in M
        if (M % 2) 
        {
          for (int k=0; k < N; k++) 
          {
            float temp = 0;

            for (int t = 0; t < (ker_dim & 0xfffffffe); t+=2) 
            {
              temp += A[(k*ker_dim+t)] * B[(M-1)*(N*ker_dim)+(k*ker_dim+t)];
              temp += A[(k*ker_dim+t+1)] * B[(M-1)*(N*ker_dim)+(k*ker_dim+t+1)];
            }
            if (ker_dim & 1) {
              temp += A[(k*ker_dim+ker_dim-1)] * B[(M-1)*(N*ker_dim)+(k*ker_dim+ker_dim-1)];
            }
            C[(M-1)+k*M]    = temp;
          }        
        } 
      } 
    } 
}




// Matmul for depthwise convolutions
void mm_dw_unroll_1x4_u2(void * void_args) {

  struct matMul_DW_args* args = (struct matMul_DW_args *)void_args;
  float * __restrict__ A = args->A;
  float * __restrict__ B = args->B;
  float * __restrict__ C = args->C;

  int N = args->N;
  int M = args->M;
  int K = args->K;

  int ker_dim = args->ker_size;

  int k = 0;

  if      (M < 4)         { mm_dw_unroll_1x2(args); }
  else if (ker_dim < 2)   { mm_dw_unroll_1x4(args); }
  else
  {
    int M_left = M % 4;

      for (int j = 0; j < (M & 0xfffffffc); j+=4) 
      {
        for (int k=0; k < N; k++) 
        {
          float temp0 = 0;
          float temp1 = 0;
          float temp2 = 0;
          float temp3 = 0;

          for (int t = 0; t < (ker_dim & 0xfffffffe); t+=2) 
          {
            float Ash  = A[(k*ker_dim+t)];
            temp0     += Ash * B[j*(N*ker_dim)+(k*ker_dim+t)];
            temp1     += Ash * B[(j+1)*(N*ker_dim)+(k*ker_dim+t)];
            temp2     += Ash * B[(j+2)*(N*ker_dim)+(k*ker_dim+t)];
            temp3     += Ash * B[(j+3)*(N*ker_dim)+(k*ker_dim+t)];
            Ash  = A[(k*ker_dim+t+1)];
            temp0     += Ash * B[j*(N*ker_dim)+(k*ker_dim+t+1)];
            temp1     += Ash * B[(j+1)*(N*ker_dim)+(k*ker_dim+t+1)];
            temp2     += Ash * B[(j+2)*(N*ker_dim)+(k*ker_dim+t+1)];
            temp3     += Ash * B[(j+3)*(N*ker_dim)+(k*ker_dim+t+1)];
          }
          if (ker_dim & 1) {
            float Ash  = A[(k*ker_dim+ker_dim-1)];
            temp0     += Ash * B[j*(N*ker_dim)+(k*ker_dim+ker_dim-1)];
            temp1     += Ash * B[(j+1)*(N*ker_dim)+(k*ker_dim+ker_dim-1)];
            temp2     += Ash * B[(j+2)*(N*ker_dim)+(k*ker_dim+ker_dim-1)];
            temp3     += Ash * B[(j+3)*(N*ker_dim)+(k*ker_dim+ker_dim-1)];           
          }
          C[j+k*M]    = temp0;
          C[j+1+k*M]  = temp1;
          C[j+2+k*M]  = temp2;
          C[j+3+k*M]  = temp3;
        }
        // Leftover in M
        if (M % 4) 
        {
          for (int j = M-M_left; j < M; j++) 
          {
            for (int k=0; k < N; k++) 
            {
              float temp = 0; 
              for (int t = 0; t < (ker_dim & 0xfffffffe); t+=2) 
              {
                temp += A[(k*ker_dim+t)] * B[j*(N*ker_dim)+(k*ker_dim+t)];
                temp += A[(k*ker_dim+t+1)] * B[j*(N*ker_dim)+(k*ker_dim+t+1)];
              }
              if (ker_dim & 1) {
                temp += A[(k*ker_dim+ker_dim-1)] * B[j*(N*ker_dim)+(k*ker_dim+ker_dim-1)];
              }
              C[j+k*M] = temp;
            }        
          }
        } 
      } 
    }
}



// Matmul for dw input grad with unrolling of 2
void mm_dw_in_grad_u2(void * void_args)
{

  struct matMul_DW_args* args = (struct matMul_DW_args *)void_args;
  float * __restrict__ A = args->A;
  float * __restrict__ B = args->B;
  float * __restrict__ C = args->C;

  int N = args->N;
  int M = args->M;
  int K = args->K;
  int ker_dim = args->ker_size;

  int Kappa = K/ker_dim;

  if (ker_dim < 2)  { mm_dw_in_grad(args); }
  else
  {
    for (int i=0; i<N; i++) 
    {
      for (int j=0; j<M; j++) 
      {
        for (int k=0; k<Kappa; k++)
        {
          float temp = 0;
          for (int u=0; u < (ker_dim & 0xfffffffe); u=u+2) 
          {
            temp += A[u+k*ker_dim] * B[u+k*ker_dim+j*K];
            temp += A[u+1+k*ker_dim] * B[u+1+k*ker_dim+j*K];
          }
          if (ker_dim & 1) {
            temp += A[ker_dim-1+k*ker_dim] * B[ker_dim-1+k*ker_dim+j*K];
          }
          C[j+k*M] = temp;
        }
      }
    }
  }
}



// Matmul for dw input grad with unrolling of 2
void mm_dw_in_grad_u3(void * void_args)
{

  struct matMul_DW_args* args = (struct matMul_DW_args *)void_args;
  float * __restrict__ A = args->A;
  float * __restrict__ B = args->B;
  float * __restrict__ C = args->C;

  int N = args->N;
  int M = args->M;
  int K = args->K;
  int ker_dim = args->ker_size;
  int Kappa = K/ker_dim;

  if (ker_dim < 3)  { mm_dw_in_grad(args); }
  else
  {
    for (int i=0; i<N; i++) 
    {
      for (int j=0; j<M; j++) 
      {
        for (int k=0; k<Kappa; k++)
        {
          float temp = 0;
          for (int u=0; u < (ker_dim & 0xfffffffd); u=u+3) 
          {
            temp += A[u+k*ker_dim] * B[u+k*ker_dim+j*K];
            temp += A[u+1+k*ker_dim] * B[u+1+k*ker_dim+j*K];
            temp += A[u+2+k*ker_dim] * B[u+2+k*ker_dim+j*K];
          }
          if (ker_dim % 3) {
            if (ker_dim & 0x00000001) {
              temp += A[ker_dim-1+k*ker_dim] * B[ker_dim-1+k*ker_dim+j*K];
            }
            else {
              temp += A[ker_dim-2+k*ker_dim] * B[ker_dim-2+k*ker_dim+j*K];
              temp += A[ker_dim-1+k*ker_dim] * B[ker_dim-1+k*ker_dim+j*K];
            }
          }
          C[j+k*M] = temp;
        }
      }
    }
  }
}



void mm_dw_in_grad_unroll_1x2(void * void_args) {

  struct matMul_DW_args* args = (struct matMul_DW_args *)void_args;
  float * __restrict__ A = args->A;
  float * __restrict__ B = args->B;
  float * __restrict__ C = args->C;

  int N = args->N;
  int M = args->M;
  int K = args->K;
  int ker_dim = args->ker_size;
  int Kappa = K/ker_dim;

  if (M < 2) { mm_dw_in_grad(args); }
  else 
  {
    for (int i=0; i<N; i++) 
    {
      for (int j=0; j< (M & 0xfffffffe); j+=2) 
      {
        for (int k=0; k<Kappa; k++)
        {
          float temp0 = 0;
          float temp1 = 0;

          for (int u=0; u<ker_dim; u++) 
          {
            // In-order weights (A matrix)
            // float Ash = A[u+k*ker_dim];
            // temp0    += Ash * B[u+k*ker_dim+j*K];
            // temp1    += Ash * B[u+k*ker_dim+(j+1)*K];
            
