pulp-platform/pulp-trainlib/lib/sources/stm32_matmul.c
            // Flipped weights (A matrix inverted channel-by-channel)
            float Ash  = A[(ker_dim-1)-u+k*ker_dim];
            temp0     += Ash * B[u+k*ker_dim+j*K];
            temp1     += Ash * B[u+k*ker_dim+(j+1)*K];
          }
          C[j+k*M]    = temp0;
          C[j+1+k*M]  = temp1;
        }
      }
      // Leftover in M
      if (M % 1) 
      {
        for (int k=0; k<Kappa; k++)
        {
          float temp = 0;
          for (int u=0; u<ker_dim; u++) 
          {
            // In-order weights (A matrix)
            // temp += A[u+k*ker_dim] * B[u+k*ker_dim+(M-1)*K];
            
            // Flipped weights (A matrix inverted channel-by-channel
            temp += A[(ker_dim-1)-u+k*ker_dim] * B[u+k*ker_dim+(M-1)*K];
          }
          C[(M-1)+k*M]    = temp;
        }        
      }
    }
  }
}



void mm_dw_in_grad_unroll_1x4(void * void_args) {

  struct matMul_DW_args* args = (struct matMul_DW_args *)void_args;
  float * __restrict__ A = args->A;
  float * __restrict__ B = args->B;
  float * __restrict__ C = args->C;

  int N = args->N;
  int M = args->M;
  int K = args->K;
  int ker_dim = args->ker_size;
  int Kappa = K/ker_dim;

  if (M < 4) { mm_dw_in_grad_unroll_1x2(args); }
  else 
  {
    int M_left = M % 4;

    for (int i=0; i<N; i++) 
    {
      for (int j=0; j< (M & 0xfffffffc); j+=4) 
      {
        for (int k=0; k<Kappa; k++)
        {
          float temp0 = 0;
          float temp1 = 0;
          float temp2 = 0;
          float temp3 = 0;

          for (int u=0; u<ker_dim; u++) 
          {
            // In-order weights (A matrix)
            // float Ash = A[u+k*ker_dim];
            // temp0    += Ash * B[u+k*ker_dim+j*K];
            // temp1    += Ash * B[u+k*ker_dim+(j+1)*K];
            // temp2    += Ash * B[u+k*ker_dim+(j+2)*K];
            // temp3    += Ash * B[u+k*ker_dim+(j+3)*K];
            
            // Flipped weights (A matrix inverted channel-by-channel)
            float Ash  = A[(ker_dim-1)-u+k*ker_dim];
            temp0     += Ash * B[u+k*ker_dim+j*K];
            temp1     += Ash * B[u+k*ker_dim+(j+1)*K];
            temp2     += Ash * B[u+k*ker_dim+(j+2)*K];
            temp3     += Ash * B[u+k*ker_dim+(j+3)*K];
          }
          C[j+k*M]    = temp0;
          C[j+1+k*M]  = temp1;
          C[j+2+k*M]  = temp2;
          C[j+3+k*M]  = temp3;
        }
      }
      // Leftover in M
      if (M % 4) 
      {
        for (int j=M-M_left; j< M; j++) 
        {
          for (int k=0; k<Kappa; k++)
          {
            float temp = 0;
            for (int u=0; u<ker_dim; u++) 
            {
              // In-order weights (A matrix)
              // temp0    += A[u+k*ker_dim] * B[u+k*ker_dim+j*K];
              
              // Flipped weights (A matrix inverted channel-by-channel)
              temp     += A[(ker_dim-1)-u+k*ker_dim] * B[u+k*ker_dim+j*K];
            }
            C[j+k*M]    = temp;
          }
        }        
      }
    }
  }
}



void mm_dw_in_grad_unroll_1x2_u2(void * void_args) {

  struct matMul_DW_args* args = (struct matMul_DW_args *)void_args;
  float * __restrict__ A = args->A;
  float * __restrict__ B = args->B;
  float * __restrict__ C = args->C;

  int N = args->N;
  int M = args->M;
  int K = args->K;
  int ker_dim = args->ker_size;
  int Kappa = K/ker_dim;

  if      (M < 2)         { mm_dw_in_grad(args); }
  else if (ker_dim < 2)   { mm_dw_in_grad_unroll_1x2(args); }
  else 
  {
    for (int i=0; i<N; i++) 
    {
      for (int j=0; j< (M & 0xfffffffe); j+=2) 
      {
        for (int k=0; k<Kappa; k++)
        {
          float temp0 = 0;
          float temp1 = 0;

          for (int u=0; u<(ker_dim & 0xfffffffe); u+=2) 
          {
            // In-order weights (A matrix)
            // float Ash = A[u+k*ker_dim];
            // temp0    += Ash * B[u+k*ker_dim+j*K];
            // temp1    += Ash * B[u+k*ker_dim+(j+1)*K];
            // Ash       = A[u+1+k*ker_dim];
            // temp0    += Ash * B[u+1+k*ker_dim+j*K];
            // temp1    += Ash * B[u+1+k*ker_dim+(j+1)*K];
            
            // Flipped weights (A matrix inverted channel-by-channel)
            float Ash  = A[(ker_dim-1)-u+k*ker_dim];
            temp0     += Ash * B[u+k*ker_dim+j*K];
            temp1     += Ash * B[u+k*ker_dim+(j+1)*K];
            Ash        = A[(ker_dim-1)-(u+1)+k*ker_dim];
            temp0     += Ash * B[u+1+k*ker_dim+j*K];
            temp1     += Ash * B[u+1+k*ker_dim+(j+1)*K];
          }
          if (ker_dim & 1) {
            // In-order weights (A matrix)
            // float Ash = A[ker_dim-1+k*ker_dim];
            // temp0    += Ash * B[ker_dim-1+k*ker_dim+j*K];
            // temp1    += Ash * B[ker_dim-1+k*ker_dim+(j+1)*K];

            // Flipped weights (A matrix inverted channel-by-channel)
            float Ash  = A[(ker_dim-1)-(ker_dim-1)+k*ker_dim];
            temp0     += Ash * B[ker_dim-1+k*ker_dim+j*K];
            temp1     += Ash * B[ker_dim-1+k*ker_dim+(j+1)*K];
          }
          C[j+k*M]    = temp0;
          C[j+1+k*M]  = temp1;
        }
      }
      // Leftover in M
      if (M % 1) 
      {
        for (int k=0; k<Kappa; k++)
        {
          float temp = 0;
          for (int u=0; u<(ker_dim & 0xfffffffe); u+=2) 
          {
            // In-order weights (A matrix)
            // temp += A[u+k*ker_dim] * B[u+k*ker_dim+(M-1)*K];
            // temp += A[u+1+k*ker_dim] * B[u+1+k*ker_dim+(M-1)*K];
            
            // Flipped weights (A matrix inverted channel-by-channel
            temp += A[(ker_dim-1)-u+k*ker_dim] * B[u+k*ker_dim+(M-1)*K];
            temp += A[(ker_dim-1)-u+1+k*ker_dim] * B[u+1+k*ker_dim+(M-1)*K];
          }
          if (ker_dim & 1) {
            temp += A[(ker_dim-1)-(ker_dim-1)+k*ker_dim] * B[(ker_dim-1)+k*ker_dim+(M-1)*K];
          }
          C[(M-1)+k*M]    = temp;
        }        
      }
    }
  }
}



void mm_dw_in_grad_unroll_1x4_u2(void * void_args) {

  struct matMul_DW_args* args = (struct matMul_DW_args *)void_args;
  float * __restrict__ A = args->A;
  float * __restrict__ B = args->B;
  float * __restrict__ C = args->C;

  int N = args->N;
  int M = args->M;
  int K = args->K;
  int ker_dim = args->ker_size;
  int Kappa = K/ker_dim;

  if      (M < 4)         { mm_dw_in_grad_unroll_1x2(args); }
  else if (ker_dim < 2)   { mm_dw_in_grad_unroll_1x4(args); }
  else 
  {
    int M_left = M % 4;

    for (int i=0; i<N; i++) 
    {
      for (int j=0; j< (M & 0xfffffffc); j+=4) 
      {
        for (int k=0; k<Kappa; k++)
        {
          float temp0 = 0;
          float temp1 = 0;
          float temp2 = 0;
          float temp3 = 0;

          for (int u=0; u<(ker_dim & 0xfffffffe); u+=2) 
          {
            // In-order weights (A matrix)
            // float Ash = A[u+k*ker_dim];
            // temp0    += Ash * B[u+k*ker_dim+j*K];
            // temp1    += Ash * B[u+k*ker_dim+(j+1)*K];
            // temp2    += Ash * B[u+k*ker_dim+(j+2)*K];
            // temp3    += Ash * B[u+k*ker_dim+(j+3)*K];
            // Ash       = A[u+1+k*ker_dim];
            // temp0    += Ash * B[u+1+k*ker_dim+j*K];
            // temp1    += Ash * B[u+1+k*ker_dim+(j+1)*K];
            // temp2    += Ash * B[u+1+k*ker_dim+(j+2)*K];
            // temp3    += Ash * B[u+1+k*ker_dim+(j+3)*K];
            
