pulp-platform/pulp-trainlib/lib/sources/stm32_matmul.c
            // Flipped weights (A matrix inverted channel-by-channel)
            float Ash  = A[(ker_dim-1)-u+k*ker_dim];
            temp0     += Ash * B[u+k*ker_dim+j*K];
            temp1     += Ash * B[u+k*ker_dim+(j+1)*K];
            temp2     += Ash * B[u+k*ker_dim+(j+2)*K];
            temp3     += Ash * B[u+k*ker_dim+(j+3)*K];
            Ash        = A[(ker_dim-1)-(u+1)+k*ker_dim];
            temp0     += Ash * B[u+1+k*ker_dim+j*K];
            temp1     += Ash * B[u+1+k*ker_dim+(j+1)*K];
            temp2     += Ash * B[u+1+k*ker_dim+(j+2)*K];
            temp3     += Ash * B[u+1+k*ker_dim+(j+3)*K];
          }
          if (ker_dim & 1) {
            // In-order weights (A matrix)
            // float Ash = A[(ker_dim-1)+k*ker_dim];
            // temp0    += Ash * B[(ker_dim-1)+k*ker_dim+j*K];
            // temp1    += Ash * B[(ker_dim-1)+k*ker_dim+(j+1)*K];
            // temp2    += Ash * B[(ker_dim-1)+k*ker_dim+(j+2)*K];
            // temp3    += Ash * B[(ker_dim-1)+k*ker_dim+(j+3)*K];

            // Flipped weights (A matrix inverted channel-by-channel)
            float Ash  = A[(ker_dim-1)-(ker_dim-1)+k*ker_dim];
            temp0     += Ash * B[(ker_dim-1)+k*ker_dim+j*K];
            temp1     += Ash * B[(ker_dim-1)+k*ker_dim+(j+1)*K];
            temp2     += Ash * B[(ker_dim-1)+k*ker_dim+(j+2)*K];
            temp3     += Ash * B[(ker_dim-1)+k*ker_dim+(j+3)*K];
          }
          C[j+k*M]    = temp0;
          C[j+1+k*M]  = temp1;
          C[j+2+k*M]  = temp2;
          C[j+3+k*M]  = temp3;
        }
      }
      // Leftover in M
      if (M % 4) 
      {
        for (int j=M-M_left; j< M; j++) 
        {
          for (int k=0; k<Kappa; k++)
          {
            float temp = 0;
            for (int u=0; u<(ker_dim & 0xfffffffe); u+=2) 
            {
              // In-order weights (A matrix)
              // temp0    += A[u+k*ker_dim] * B[u+k*ker_dim+j*K];
              // temp0    += A[u+1+k*ker_dim] * B[u+1+k*ker_dim+j*K];
              
              // Flipped weights (A matrix inverted channel-by-channel)
              temp     += A[(ker_dim-1)-u+k*ker_dim] * B[u+k*ker_dim+j*K];
              temp     += A[(ker_dim-1)-(u+1)+k*ker_dim] * B[u+1+k*ker_dim+j*K];
            }
            if (ker_dim & 1) {
              // In-order weights (A matrix)
              // temp0    += A[(ker_dim-1)+k*ker_dim] * B[(ker_dim-1)+k*ker_dim+j*K];

              // Flipped weights (A matrix inverted channel-by-channel)
              temp     += A[(ker_dim-1)-(ker_dim-1)+k*ker_dim] * B[(ker_dim-1)+k*ker_dim+j*K];                            
            }
            C[j+k*M]    = temp;
          }
        }        
      }
    }
  }
}
